#include "CRandom.h"


//=============================================================================
//		ランダムクラス.
//=============================================================================
CRandom::CRandom()
	: m_RandomEngine (std::random_device{}())
{
}

CRandom::~CRandom()
{
}


//=============================================================================
//		指定した範囲のランダムな整数を生成する.
//=============================================================================
int CRandom::GetRandomInt(int min, int max)
{
	std::uniform_int_distribution<int> dist(min, max); // 整数の一様分布を定義.
	return dist(m_RandomEngine); // 乱数を生成して返す.
}


//=============================================================================
//		指定した範囲のランダムな浮動小数点数を生成する.
//=============================================================================
float CRandom::GetRandomFloat(float min, float max)
{
	std::uniform_real_distribution<float> dist(min, max); // 浮動小数の一様分布を定義.
	return dist(m_RandomEngine); // 乱数を生成して返す.
}